TexasInstruments/c2000ware-core-sdk/device_support/f2805x/common/include/F2805x_SWPrioritizedIsrLevels.h
//###########################################################################
//
// FILE:    F2805x_SWPrioritizedIsrLevels.h
//
// TITLE:   DSP28 Devices Software Prioritized Interrupt Service Routine
//          Level definitions.
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright:
// Copyright (C) 2012-2026 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef F2805x_SW_PRIORITZIED_ISR_H
#define F2805x_SW_PRIORITZIED_ISR_H

#ifdef __cplusplus
extern "C" {
#endif

//
// Interrupt Enable Register Allocation For 2805x Devices:
//
// Interrupts can be enabled/disabled using the CPU __interrupt enable register
// (IER) and the PIE __interrupt enable registers (PIEIER1 to PIEIER12).
//
//
// Set "Global" Interrupt Priority Level (IER register):
//
// The user must set the appropriate priority level for each of the CPU
// __interrupts. This is termed as the "global" priority. The priority level
// must be a number between 1 (highest) to 16 (lowest). A value of 0 must
// be entered for reserved __interrupts or __interrupts that are not used. This
// will also reduce code size by not including ISR's that are not used.
//
// Note: The priority levels below are used to calculate the IER register
//       __interrupt masks MINT1 to MINT16.
//
//
// Note: The priority levels shown here may not make sense in a
//       real application.  This is for demonstration purposes only!!!
//
//       The user should change these to values that make sense for
//       their application.
//
// 0  = not used
// 1  = highest priority
// ...
// 16 = lowest priority
#define INT1PL      2        // Group1 Interrupts (PIEIER1)
#define INT2PL      1        // Group2 Interrupts (PIEIER2)
#define INT3PL      4        // Group3 Interrupts (PIEIER3)
#define INT4PL      2        // Group4 Interrupts (PIEIER4)
#define INT5PL      2        // Group5 Interrupts (PIEIER5)
#define INT6PL      3        // Group6 Interrupts (PIEIER6)
#define INT7PL      0        // reserved
#define INT8PL      5        // reserved
#define INT9PL      3        // Group9 Interrupts (PIEIER9)
#define INT10PL     6        // reserved
#define INT11PL     6        // reserved
#define INT12PL     8        // reserved
#define INT13PL     4        // XINT13
#define INT14PL     4        // INT14 (TINT2)
#define INT15PL     4        // DATALOG
#define INT16PL     4        // RTOSINT

//
// Set "Group" Interrupt Priority Level (PIEIER1 to PIEIER12 registers):
//
// The user must set the appropriate priority level for each of the PIE
// __interrupts. This is termed as the "group" priority. The priority level
// must be a number between 1 (highest) to 8 (lowest). A value of 0 must
// be entered for reserved __interrupts or __interrupts that are not used. This
// will also reduce code size by not including ISR's that are not used:
//
// Note: The priority levels below are used to calculate the following
//       PIEIER register __interrupt masks:
//                           MG11 to MG18
//                           MG21 to MG28
//                           MG31 to MG38
//                           MG41 to MG48
//                           MG51 to MG58
//                           MG61 to MG68
//                           MG71 to MG78
//                           MG81 to MG88
//                           MG91 to MG98
//                           MG101 to MG108
//                           MG111 to MG118
//                           MG121 to MG128
//
// Note: The priority levels shown here may not make sense in a
//       real application.  This is for demonstration purposes only!!!
//
//       The user should change these to values that make sense for
//       their application.
//
// 0  = not used
// 1  = highest priority
// ...
// 8  = lowest priority
//

#define G11PL       7        // ADCINT1     (ADC) or rsvd if 10.1 is ADCINT1
#define G12PL       6        // ADCINT2     (ADC) or rsvd if 10.2 is ADCINT2
#define G13PL       0        // reserved
#define G14PL       1        // XINT1       (External)
#define G15PL       3        // XINT2       (External)
#define G16PL       2        // ADCINT9     (ADC)
#define G17PL       1        // TINT0       (CPU Timer 0)
#define G18PL       5        // WAKEINT     (WD/LPM)

#define G21PL       4        // EPWM1_TZINT (ePWM1 Trip)
#define G22PL       3        // EPWM2_TZINT (ePWM2 Trip)
#define G23PL       2        // EPWM3_TZINT (ePWM3 Trip)
#define G24PL       1        // EPWM4_TZINT (ePWM4 Trip)
#define G25PL       3        // EPWM5_TZINT (ePWM5 Trip)
#define G26PL       5        // EPWM6_TZINT (ePWM6 Trip)
#define G27PL       2        // EPWM7_TZINT (ePWM7 Trip)
#define G28PL       0        // reserved

#define G31PL       4        // EPWM1_INT   (ePWM1 Int)
#define G32PL       1        // EPWM2_INT   (ePWM2 Int)
#define G33PL       1        // EPWM3_INT   (ePWM3 Int)
#define G34PL       2        // EPWM4_INT   (ePWM4 Int)
#define G35PL       3        // EPWM5_INT   (ePWM5 Int)
#define G36PL       6        // EPWM6_INT   (ePWM6 Int)
#define G37PL       5        // EPWM7_INT   (ePWM7 Int)
#define G38PL       0        // reserved

#define G41PL       1        // ECAP1_INT   (eCAP1 Int)
#define G42PL       0        // reserved
#define G43PL       0        // reserved
#define G44PL       0        // reserved
#define G45PL       0        // reserved
#define G46PL       0        // reserved
#define G47PL       0        // reserved
#define G48PL       0        // reserved

#define G51PL       1        // EQEP1_INT   (eQEP1 Int)
#define G52PL       0        // reserved
#define G53PL       0        // reserved
#define G54PL       0        // reserved
#define G55PL       0        // reserved
#define G56PL       0        // reserved
#define G57PL       0        // reserved
#define G58PL       0        // reserved

#define G61PL       2        // SPIRXINTA (SPI-A)
#define G62PL       1        // SPITXINTA (SPI-A)
#define G63PL       0        // reserved
#define G64PL       0        // reserved
#define G65PL       0        // reserved
#define G66PL       0        // reserved
#define G67PL       0        // reserved
#define G68PL       0        // reserved


#define G71PL      0        // reserved
#define G72PL      0        // reserved
#define G73PL      0        // reserved
#define G74PL      0        // reserved
#define G75PL      0        // reserved
#define G76PL      0        // reserved
#define G77PL      0        // reserved
#define G78PL      0        // reserved


#define G81PL       1        // I2CINT1A  (I2C-A)
#define G82PL       2        // I2CINT2A  (I2C-A)
#define G83PL       0        // reserved
#define G84PL       0        // reserved
#define G85PL       4        // SCIRXINTC (SCI-C)
#define G86PL       3        // SCITXINTC (SCI-C)
#define G87PL       0        // reserved
#define G88PL       0        // reserved

#define G91PL       1        // SCIRXINTA (SCI-A)
#define G92PL       5        // SCITXINTA (SCI-A)
#define G93PL       3        // SCIRXINTB (SCI-B)
#define G94PL       4        // SCITXINTB (SCI-B)
#define G95PL       1        // ECAN0INTA (ECAN-A)
#define G96PL       1        // ECAN1INTA (ECAN-A)
#define G97PL       0        // reserved
#define G98PL       0        // reserved


#define G101PL      0        // reserved  or ADCINT1 (define G11PL as 0 / rsvd)
#define G102PL      0        // reserved  or ADCINT2 (define G12PL as 0 / rsvd)
#define G103PL      1        // ADCINT3   (ADC)
#define G104PL      4        // ADCINT4   (ADC)
#define G105PL      5        // ADCINT5   (ADC)
#define G106PL      7        // ADCINT6   (ADC)
#define G107PL      7        // ADCINT7   (ADC)
#define G108PL      3        // ADCINT8   (ADC)


